In [1]:
import pandas as pd

In [35]:
df = pd.read_csv('https://raw.githubusercontent.com/SumanGouda/Scikit-Learn-/refs/heads/main/Feature%20Engineering/Data%20Extraction/laptops_new.csv')

In [36]:
json =[
  { "id": 1, "name": "Joe", "salary": 70000, "managerId": 3 },
  { "id": 2, "name": "Henry", "salary": 80000, "managerId": 4 },
  { "id": 3, "name": "Sam", "salary": 60000, "managerId": 'null' },
  { "id": 4, "name": "Max", "salary": 90000, "managerId": 'null' }
]

In [37]:
df = pd.DataFrame(json)
df.head()

   id   name  salary managerId
0   1    Joe   70000         3
1   2  Henry   80000         4
2   3    Sam   60000      null
3   4    Max   90000      null

In [38]:
emp_df = df[df['managerId'] != 'null']
man_df = df[df['managerId'] == 'null']
man_df.head()

   id name  salary managerId
2   3  Sam   60000      null
3   4  Max   90000      null

In [39]:

man_df = man_df.rename(columns={'name': 'name_man', 'salary': 'salary_man'})
man_df.drop(columns=['managerId'], inplace=True)
new = pd.merge(emp_df, man_df, how='left', left_on='managerId', right_on='id')

In [40]:
new.head()

   id_x   name  salary managerId  id_y name_man  salary_man
0     1    Joe   70000         3     3      Sam       60000
1     2  Henry   80000         4     4      Max       90000

In [55]:
fil_df = new[new['salary'] > new['salary_man']][['name']].rename(columns={'name': 'Employee'})

In [59]:
import pandas as pd

def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    df = employee
    emp_df = df[df['managerId'] != 'null']
    man_df = df[df['managerId'] == 'null']
    man_df = man_df.rename(columns={'name': 'name_man', 'salary': 'salary_man'})
    man_df.drop(columns=['managerId'], inplace=True)
    new = pd.merge(emp_df, man_df, how='left', left_on='managerId', right_on='id')
    req_df = new[new['salary'] > new['salary_man']][['name']].rename(columns={'name': 'Employee'})
    return req_df

find_employees(df)

  Employee
0      Joe